ИМСИТ/src/Documents/ПродажаТовара/ПродажаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТовара</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товар</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИМСИТ/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Товар</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИМСИТ/src/Documents/ПродажаТовара/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПозицииТоваровЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПозицииТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Итого = (СтрокаТабличнойЧасти.Цена - ((СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Скидка) / 100)) * СтрокаТабличнойЧасти.Количество;
	Объект.СуммаПродажи = Объект.ПозицииТоваров.Итог("Итого");
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровСкидкаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПозицииТоваров.ТекущиеДанные;	
	СтрокаТабличнойЧасти.Итого = (СтрокаТабличнойЧасти.Цена - ((СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Скидка) / 100)) * СтрокаТабличнойЧасти.Количество;
	Объект.СуммаПродажи = Объект.ПозицииТоваров.Итог("Итого");
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПозицииТоваров.ТекущиеДанные;	
	СтрокаТабличнойЧасти.Итого = (СтрокаТабличнойЧасти.Цена - ((СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Скидка) / 100)) * СтрокаТабличнойЧасти.Количество;
	Объект.СуммаПродажи = Объект.ПозицииТоваров.Итог("Итого");
КонецПроцедуры

&НаСервере
Процедура ПозицииТоваровТоварПриИзмененииНаСервере(Товар, Цена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.ПозицииТоваров.ТекущиеДанные;
	ПозицииТоваровТоварПриИзмененииНаСервере(ТекСтрока.Товар, ТекСтрока.Цена);
КонецПроцедуры
